atom-editor
auto-auto-complete
ccat
clion
geoclue
global
google-chrome
gtk-theme-elementary-bzr
ipython-notebook
leiningen
libindicator-gtk2
libtinfo
libtinfo-5
libzeitgeist
lightdm-pantheon-greeter
luacairo
minted
opam
openvpn-update-resolv-conf
papirus-qtcurve-theme
powerline-fonts-git
python-scikit-image
python2-scikit-image
qnapi
rubymine
spotify
ttf-opensans
ttf-vlkoruri
yaourt
