extra/abiword
extra/abs
community/acpi
community/acpid
community/alex
extra/alsa-utils
community/android-tools
community/arandr
extra/arch-install-scripts
community/aria2
local/aspcud-svn
extra/aspell-en
community/astyle
community/aumix
core/autoconf
community/autojump
core/automake
extra/baobab
core/bash
extra/bc
local/biicode
extra/bind-tools
core/bison
extra/bluez-utils
local/boot
core/bzip2
infinality-bundle/cairo-infinality-ultimate
community/calibre
community/camlp4
community/cargo
local/ccat
extra/clang-analyzer
extra/clang-tools-extra
local/clion
extra/cmake
local/conky-lua
core/coreutils
core/cronie
core/cryptsetup
extra/ctags
local/customizepkg-new
community/dart
extra/dconf-editor
community/deadbeef
extra/deluge
extra/devhelp
core/device-mapper
core/dhcpcd
core/diffutils
community/dmenu
community/docker
community/dzen2
core/e2fsprogs
community/ecryptfs-utils
core/efibootmgr
core/efivar
community/elementary-icon-theme
local/emacs-git
local/emacspeak
extra/empathy
extra/eog
extra/epiphany
extra/ethtool
extra/evince
extra/extra-cmake-modules
core/fakeroot
core/file
extra/file-roller
core/filesystem
core/findutils
extra/firefox
extra/flashplugin
core/flex
infinality-bundle/fontconfig-infinality-ultimate
community/fzf
extra/gamin
core/gawk
extra/gdm
core/gettext
extra/gimp
extra/git
core/glibc
local/global
community/gmrun
extra/gnome-backgrounds
extra/gnome-calculator
extra/gnome-clocks
extra/gnome-contacts
extra/gnome-control-center
extra/gnome-dictionary
extra/gnome-disk-utility
extra/gnome-font-viewer
extra/gnome-icon-theme-extras
extra/gnome-keyring
extra/gnome-screenshot
extra/gnome-session
extra/gnome-settings-daemon
extra/gnome-shell
extra/gnome-shell-extensions
extra/gnome-system-log
extra/gnome-system-monitor
extra/gnome-terminal
extra/gnome-tweak-tool
extra/gnome-user-docs
extra/gnome-user-share
extra/gnuplot
local/google-chrome
extra/gparted
extra/graphviz
core/grep
extra/grilo-plugins
core/grub
community/gtest
community/gtk-chtheme
community/gtk-engine-murrine
local/gtk-engine-unico
local/gtk-theme-elementary-bzr
community/gtk2hs-buildtools
extra/gucharmap
community/guvcview
extra/gvfs-smb
extra/gvim
core/gzip
community/happy
community/haskell-stack
core/hdparm
extra/htop
local/i3-kde
local/idutils
core/inetutils
extra/inkscape
core/iproute2
core/iputils
community/ipython
local/ipython-notebook
community/ipython2-notebook
core/jfsutils
extra/kdebase-kdepasswd
extra/kdebase-kdialog
community/keepassx
community/kshutdown
local/leiningen
local/leiningen-completions
core/less
multilib/lib32-glibc
core/libtool
core/licenses
extra/lightdm
extra/lightdm-kde-greeter
local/lightdm-pantheon-greeter
core/linux
local/liquidprompt
extra/llvm
core/logrotate
community/lua-messagepack
community/lua52-messagepack
local/luacairo
core/lvm2
core/make
core/man-db
core/man-pages
community/mathjax
core/mdadm
extra/memtest86+
extra/mesa-demos
local/minted
core/mlocate
extra/mousetweaks
extra/mutter
core/nano
extra/nautilus
community/nautilus-actions
community/ncdu
community/nemiver
core/netctl
community/nodejs
community/npm
extra/ntfs-3g
extra/ntp
extra/ocaml
community/ocaml-findlib
local/opam
core/openssh
extra/p7zip
local/package-query
core/pacman
core/patch
extra/pavucontrol
core/pciutils
core/pcmciautils
community/pdfpc
core/perl
core/pkg-config
extra/pkgfile
local/plank-theme-pantheon-bzr
extra/plasma-meta
extra/postgresql
local/powerline-fonts-git
core/procps-ng
core/psmisc
community/pygmentize
extra/pygtk
extra/python-dbus
community/python-httplib2
community/python-matplotlib
community/python-scikit-image
community/python-scikit-learn
community/python-sympy
extra/python-virtualenv
community/python2-matplotlib
extra/python2-numpy
community/python2-pygments
community/python2-scikit-image
community/python2-scikit-learn
local/qnapi
community/qt5ct
community/redshift
extra/refind-efi
core/reiserfsprogs
core/rfkill
community/rlwrap
extra/rsync
community/rsyslog
local/rubymine
community/rxvt-unicode
community/rxvt-unicode-terminfo
core/s-nail
extra/sdl_gfx
core/sed
core/shadow
local/slack-desktop
local/spotify
extra/subversion
core/sudo
extra/sushi
core/sysfsutils
core/systemd-sysvcompat
core/tar
extra/telepathy-gabble
extra/telepathy-haze
extra/telepathy-idle
extra/telepathy-kde-accounts-kcm
extra/telepathy-kde-approver
extra/telepathy-kde-auth-handler
extra/telepathy-kde-common-internals
extra/telepathy-kde-contact-list
extra/telepathy-kde-contact-runner
extra/telepathy-kde-desktop-applets
extra/telepathy-kde-filetransfer-handler
extra/telepathy-kde-integration-module
extra/telepathy-kde-send-file
extra/telepathy-kde-text-ui
extra/telepathy-rakia
extra/telepathy-salut
core/texinfo
extra/texlive-bibtexextra
extra/texlive-bin
extra/texlive-core
extra/texlive-fontsextra
extra/texlive-formatsextra
extra/texlive-games
extra/texlive-genericextra
extra/texlive-htmlxml
extra/texlive-humanities
extra/texlive-latexextra
extra/texlive-music
extra/texlive-pictures
extra/texlive-plainextra
extra/texlive-pstricks
extra/texlive-publishers
extra/texlive-science
community/the_silver_searcher
community/tlp
community/tmux
extra/totem
core/traceroute
extra/tree
extra/ttf-dejavu
extra/ttf-freefont
community/ttf-liberation
local/ttf-opensans
community/ttf-symbola
local/ttf-vlkoruri
community/unclutter
extra/unrar
extra/unzip
community/urxvt-perls
core/usbutils
core/util-linux
community/vagrant
core/vi
extra/vino
community/virtualbox
extra/vlc
community/weston
extra/wget
core/which
extra/whois
community/wmctrl
core/wpa_actiond
core/wpa_supplicant
extra/xclip
extra/xdg-user-dirs-gtk
extra/xf86-input-synaptics
extra/xf86-video-intel
extra/xf86-video-vesa
core/xfsprogs
community/xmonad
community/xmonad-contrib
local/xorg-grandr
extra/xorg-server
extra/xorg-server-utils
extra/xorg-server-xephyr
extra/xorg-xdpyinfo
extra/xscreensaver
local/yaourt
extra/yelp
extra/zip
extra/zsh
