arc-dark-lxqt-manjaro
arc-dark-suite
atom-editor
ccat
clion
global
google-chrome
gtk-theme-elementary-bzr
intellij-idea-ultimate-edition
ipython-notebook
leiningen
libtinfo-5
lightdm-pantheon-greeter
luacairo
minted
opam
openvpn-update-resolv-conf
papirus-aurorae-theme
papirus-color-scheme
papirus-gtk-theme
papirus-look-and-feel
papirus-plasma-theme
papirus-vlc-theme
powerline-fonts-git
pycharm-professional
python-scikit-image
python2-scikit-image
qnapi
rubymine
slack-desktop
spotify
ttf-opensans
ttf-vlkoruri
vlc-arc-dark-git
yaourt
