abs
acpi
alex
alsa-utils
arch-install-scripts
aria2
asciidoc
aspell-en
astyle
autoconf
autojump
automake
bc
bind-tools
bison
bluez-utils
boost
calibre
camlp4
cargo
clang-tools-extra
cronie
deluge
dmenu
docbook2x
docker
dolphin-plugins
ecryptfs-utils
elementary
emacs
eog
extra-cmake-modules
fakeroot
farstream-0.1
flashplugin
flex
fzf
gegl
gnome-icon-theme-extras
gnome-menus
go
gobject-introspection
gparted
graphviz
grub
gtk-engines
gtk2hs-buildtools
gvim
happy
haskell-conduit-combinators
haskell-email-validate
haskell-file-embed
haskell-stack
haskell-uuid
haskell-word8
htdig
htop
inetutils
intltool
iputils
ipython2-notebook
julia
jupyter-notebook
kdebase-kdepasswd
keepassx
lib32-curl
libconfig
libgsystem
licenses
linux
llvm
llvm35-libs
logrotate
lua-expat
lua-lpeg
lua51-lpeg
lua51-messagepack
lvm2
man-db
man-pages
mdadm
memtest86+
mlocate
mosh
nano
ncdu
netctl
ntp
ocaml-findlib
p7zip
pcmciautils
perl-xml-libxml
pkg-config
pkgfile
plasma-meta
postgresql
povray
pth
python-click
python-httplib2
python-pip
python-pytest
python-scikit-learn
python-sympy
python-virtualenv
python2-atspi
python2-pytest
python2-scikit-learn
qt5-translations
qt5ct
re2c
redshift
refind-efi
remind
scons
sudo
task
texlive-bibtexextra
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-htmlxml
texlive-humanities
texlive-music
texlive-plainextra
texlive-pstricks
texlive-publishers
texlive-science
the_silver_searcher
thefuck
tlp
tolua++
traceroute
tree
ttf-symbola
unrar
unzip
urxvt-perls
vagrant
vala
vi
virtualbox
which
whois
wxgtk2.8
xclip
xf86-input-synaptics
xf86-video-intel
xf86-video-vesa
xorg-server
xorg-server-utils
xorg-xdpyinfo
xscreensaver
zip
