abs
acpi
alex
alsa-utils
arch-install-scripts
aria2
aspell-en
aspell-pl
astyle
autoconf
autojump
automake
bind-tools
bison
bluez-utils
boost
calibre
camlp4
cargo
clang-tools-extra
cronie
deluge
dmenu
docker
dolphin-plugins
ecryptfs-utils
eog
extra-cmake-modules
fakeroot
flashplugin
flex
fzf
gnome-icon-theme-extras
gnome-menus
go
gparted
graphviz
grub
happy
haskell-gtk2hs-buildtools
htop
httpie
iputils
ipython2-notebook
jq
julia
kdebase-kdepasswd
kdegraphics-okular
keepassx
libconfig
licenses
linux
llvm
logrotate
lvm2
lxqt-about
lxqt-config
lxqt-notificationd
lxqt-openssh-askpass
lxqt-panel
lxqt-policykit
lxqt-powermanagement
lxqt-qtplugin
lxqt-runner
lxqt-session
lxqt-sudo
man-db
man-pages
mdadm
memtest86+
mlocate
mosh
nano
ncdu
netctl
ntp
ocaml-findlib
openbox
p7zip
pcmanfm-qt
pcmciautils
pkg-config
pkgfile
plasma-meta
postgresql
povray
python-httplib2
python-scikit-learn
python-sympy
python-virtualenv
python2-scikit-learn
qt5ct
qtcurve-gtk2
qtcurve-qt4
qtcurve-qt5
ranger
redshift
refind-efi
remind
swi-prolog
task
terminology
texlive-bibtexextra
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-htmlxml
texlive-humanities
texlive-music
texlive-plainextra
texlive-pstricks
texlive-publishers
texlive-science
the_silver_searcher
thefuck
tlp
traceroute
tree
ttf-symbola
unrar
unzip
urxvt-perls
vi
virtualbox
whois
xclip
xf86-input-synaptics
xf86-video-intel
xf86-video-vesa
xorg-server
xorg-server-utils
xorg-xdpyinfo
xscreensaver
zip
