acpi
acpid
alsa-utils
aria2
astyle
aumix
autoconf
automake
bison
cabal-install
cmake
conky
cronie
cryptsetup
devhelp
dmenu
dzen2
ethtool
fakeroot
file
flashplugin
flex
gamin
gettext
git
gmrun
gparted
gtk-chtheme
gtk2-xfce-engine
gtk2hs-buildtools
gtk3-xfce-engine
guvcview
gvfs-smb
hdparm
heirloom-mailx
i3status
iputils
jfsutils
kdeutils-ark
laptop-mode-tools
libtool
licenses
lightdm-gtk3-greeter
linux
logrotate
lvm2
lxappearance-obconf
lxde-common
lxinput
lxlauncher
lxmusic
lxpanel
lxrandr
lxshortcut
lxtask
lxterminal
make
man-db
man-pages
mdadm
mousepad
ntfs-3g
ntp
obconf
obkey
openbox-themes
openssh
p7zip
patch
pcmanfm
pcmciautils
pkg-config
pkgfile
reiserfsprogs
rfkill
rsyslog
sdl_gfx
sudo
systemd-sysvcompat
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
traceroute
tumbler
unrar
unzip
usbutils
vi
vim
wget
which
whois
wpa_actiond
xcursor-bluecurve
xdotool
xf86-input-synaptics
xf86-video-intel
xf86-video-vesa
xfburn
xfce4-appfinder
xfce4-artwork
xfce4-battery-plugin
xfce4-clipman-plugin
xfce4-cpufreq-plugin
xfce4-cpugraph-plugin
xfce4-datetime-plugin
xfce4-dict
xfce4-diskperf-plugin
xfce4-eyes-plugin
xfce4-fsguard-plugin
xfce4-genmon-plugin
xfce4-mailwatch-plugin
xfce4-mixer
xfce4-mount-plugin
xfce4-mpc-plugin
xfce4-netload-plugin
xfce4-notes-plugin
xfce4-notifyd
xfce4-power-manager
xfce4-quicklauncher-plugin
xfce4-screenshooter
xfce4-sensors-plugin
xfce4-session
xfce4-settings
xfce4-smartbookmark-plugin
xfce4-systemload-plugin
xfce4-taskmanager
xfce4-terminal
xfce4-time-out-plugin
xfce4-timer-plugin
xfce4-verve-plugin
xfce4-wavelan-plugin
xfce4-weather-plugin
xfce4-xkb-plugin
xfdesktop
xfsprogs
xfwm4-themes
xmonad-contrib
xorg-server-utils
xorg-server-xephyr
xscreensaver
xterm
zip
zsh
rxvt-unicode 
rxvt-unicode-terminfo 
urxvt-perls  
xorg-server
midori
xclip
evince
gv
vlc
deadbeef
abiword
ttf-dejavu
orage
