tap "caskroom/fonts"
tap "crisidev/chunkwm"
tap "d12frosted/emacs-plus"
tap "esphen/wsta", "https://github.com/esphen/wsta.git"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/fuse"
tap "homebrew/services"
tap "jmacdonald/amp"
tap "justwatchcom/gopass"
tap "koekeishiya/formulae"
tap "rcmdnk/file"
tap "sinclairtarget/wst"
tap "vitorgalvao/tiny-scripts"
tap "xo/xo"
cask "osxfuse"
brew "gdbm"
brew "libyaml"
brew "openssl"
brew "ossp-uuid"
brew "readline"
brew "python"
brew "ansible"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "libtool", args: ["universal"]
brew "asdf"
brew "aspcud"
brew "aws-shell"
brew "awscli"
brew "binutils", link: true
brew "bison"
brew "gettext"
brew "libffi"
brew "ccat"
brew "cloc"
brew "cscope"
brew "ctags"
brew "curl"
brew "dep"
brew "direnv"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "elixir"
brew "elm"
brew "fd"
brew "nettle"
brew "little-cms2"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "gd"
brew "geeknote", args: ["HEAD"]
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "jasper"
brew "graphicsmagick"
brew "hiredis"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "inetutils"
brew "iproute2mac"
brew "ispell"
brew "oniguruma"
brew "jq"
brew "node"
brew "jsonlint"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "leiningen"
brew "libcroco"
brew "libgphoto2"
brew "libicns", args: ["universal"]
brew "libmagic"
brew "libzip"
brew "makedepend"
brew "mitmproxy"
brew "mosh"
brew "most"
brew "net-snmp"
brew "nmap"
brew "oath-toolkit"
brew "opam"
brew "parallel"
brew "patchutils"
brew "pinentry"
brew "pinentry-mac"
brew "pngquant"
brew "popt"
brew "postgresql", restart_service: true
brew "postgresql@10"
brew "rabbitmq", restart_service: true
brew "ranger"
brew "re2"
brew "rebar3"
brew "redis", restart_service: true
brew "remind"
brew "ripgrep"
brew "rpm"
brew "ruby-install"
brew "rustup-init"
brew "sane-backends"
brew "shellcheck"
brew "siege"
brew "skaffold"
brew "smartmontools"
brew "sops"
brew "speedtest-cli"
brew "sshfs"
brew "swi-prolog"
brew "tcpkali"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tree"
brew "unzip"
brew "watch"
brew "websocketd"
brew "wget"
brew "xsv"
brew "zip", link: true
brew "d12frosted/emacs-plus/emacs-plus"
brew "esphen/wsta/wsta"
brew "heroku/brew/heroku"
brew "jmacdonald/amp/amp"
brew "koekeishiya/formulae/chunkwm"
brew "koekeishiya/formulae/skhd", args: ["HEAD", "with-logging"]
brew "rcmdnk/file/brew-file"
brew "sinclairtarget/wst/um"
brew "vitorgalvao/tiny-scripts/cask-repair"
brew "xo/xo/usql"
cask "arduino"
cask "aws-vault"
cask "chefdk"
cask "etcher"
cask "eventstore"
cask "google-cloud-sdk"
cask "gpgtools"
cask "java"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "caskroom/fonts/font-hasklig-nerd-font"
