fisherman/await
oh-my-fish/plugin-bak
edc/bass
oh-my-fish/plugin-bundler
fisherman/fzf
laughedelic/pisces
fisherman/spin
fisherman/z
oh-my-fish/plugin-wttr
