fisherman/await
oh-my-fish/plugin-bak
edc/bass
oh-my-fish/theme-budspencer
oh-my-fish/plugin-bundler
fisherman/fzf
fisherman/getopts
fisherman/last_job_id
fisherman/rvm
oh-my-fish/plugin-thefuck
oh-my-fish/plugin-wttr
fisherman/z
